var searchData=
[
  ['Библиотека_20libcore_2c_20в_20составе_20проекта_20c_2b_2b_20developer_20professional_20otus_27_20course_20_28cpp_5fotus_29_70',['Библиотека libcore, в составе проекта C++ Developer Professional Otus&apos; Course (cpp_otus)',['../group__core.html',1,'']]],
  ['Макет_20классов_20для_20сборки_20эскизного_20приложения_20_22Простейший_20графический_20векторный_20редактор_22_71',['Макет классов для сборки эскизного приложения &quot;Простейший графический векторный редактор&quot;',['../group__homework13.html',1,'']]]
];
