// -*- mode: c++; coding: utf-8 -*-
#include <iostream>


/*! \brief Задача №1787. Поворот на МЕГУ
*
* https://acm.timus.ru/problem.aspx?space=1&num=1787
*
* Светофор, установленный на повороте в торговый центр "МЕГА" с Новомосковского
* тракта, работает в таком режиме, что за одну минуту повернуть успевают k
* машин. По выходным, когда жители города едут закупаться продуктами и одеждой,
* перед этим поворотом вырастает огромная пробка. Администрация торгового центра
* дала указание повесить под строящимся неподалёку мостом камеру, подсчитывающую
* количество автомобилей, подъезжающих к этому повороту со стороны города. По
* информации, полученной с камеры за n минут, прошедших с начала наблюдений,
* определите количество машин, стоящих в пробке в настоящий момент времени.
*
* Исходные данные: В первой строке записаны целые числа k и n (1 <= k, n <= 100)
* — количество машин, успевающих повернуть на "МЕГУ" в течение минуты, и
* количество минут, прошедших с начала наблюдений. Во второй строке через пробел
* записаны целые числа a1, ..., an (0 <= ai <= 100), где ai — количество машин,
* подъехавших к повороту со стороны города в течение i-й минуты. Можно считать,
* что наблюдения начинаются рано утром, когда машин, ожидающих на повороте, ещё
* нет.
*
* Результат: Выведите количество машин, стоящих в пробке на повороте через n
* минут после начала наблюдений.
*/
int main()
{
  int k, n, ai, a_rest = 0;
  std::cin >> k >> n;
  for (int i = 0; i < n; ++i)
  {
    std::cin >> ai;
    a_rest += ai - k;
    if (a_rest < 0)
      a_rest = 0;
  }
  std::cout << a_rest << std::endl;
  return 0;
}

