// -*- mode: c++; coding: utf-8 -*-
#include <iostream>


/*! \brief Задача №2021. Про Гришу Н.
*
* https://acm.timus.ru/problem.aspx?space=1&num=2012
*
* Гриша Н. сказал двум своим товарищам по команде, что даже если они не придут
* на четвертьфинал чемпионата мира, он решит на соревновании все предложенные
* задачи. Сокомандники Грише не поверили, и тогда он рассказал им план, как он
* собирается это сделать.
*
* За первый час он хочет решить f задач. Если до конца первого часа ещё
* останется время, Гриша просто пойдёт гулять по коридору. Начиная со второго
* часа Гриша хочет тратить на каждую из оставшихся задач ровно по 45 минут.
* Если план Гриши удастся, сможет ли он решить за 5 часов соревнования все 12
* предложенных задач?
*
* Исходные данные: В единственной строке записано целое число f — сколько задач
* хочет решить Гриша за первый час соревнования (1 <= f <= 11).
*
* Результат: Выведите "YES", если Грише в одиночку удастся решить все
* предложенные задачи, и "NO" в противном случае.
*/
int main()
{
  int f;
  std::cin >> f;
  if (f >= (12 - 5)) // 5 = 60*4 / 45
    std::cout << "YES" << std::endl;
  else
    std::cout << "NO" << std::endl;
  return 0;
}

